In [1]:
import pandas as pd

In [2]:
dict1 = {'name':['Priyang','Aadhaya','Krisha','Vedant','Parshv','Mittal','Archana'],
        'Marks': [98,89,99,87,90,83,99],
        'Gender' : ['Male','Female','Female','Male','Male','Female','Female']
        }
df1 = pd.DataFrame(dict1)
df1

      name  Marks  Gender
0  Priyang     98    Male
1  Aadhaya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

#### 1. Display Top 3 rows of the Dataset

In [3]:
df1.head(3)

      name  Marks  Gender
0  Priyang     98    Male
1  Aadhaya     89  Female
2   Krisha     99  Female

#### 2. Display Last 3 rows of the Dataset

In [4]:
df1.tail(3)

      name  Marks  Gender
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

#### 3. Find shape of our Dataset (Number of Rows & Number of Columns)

In [5]:
df1.shape #Return a tuple (Rows , columns)
print("Rows: {}".format(df1.shape[0]))
print("Columns: {}".format(df1.shape[1]))

Rows: 7
Columns: 3

#### 4. Get information about our dataset like total number rows, total number of columns, datatypes of each column and memory

In [6]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 296.0+ bytes

#### 5. check Null values in the Dataset

In [7]:
df1.isnull().sum(axis = 0) # axis 1 verify rows, axis 0 verify columns

name      0
Marks     0
Gender    0
dtype: int64

#### 6. Get overall Statics About the dataFrame

In [8]:
df1.describe() #include = all, verify all de columns

           Marks
count   7.000000
mean   92.142857
std     6.491753
min    83.000000
25%    88.000000
50%    90.000000
75%    98.500000
max    99.000000

#### 7. find unique values from the gender column

In [9]:
df1

      name  Marks  Gender
0  Priyang     98    Male
1  Aadhaya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [10]:
df1['Gender'].unique()

array(['Male', 'Female'], dtype=object)

#### 8. Find the Number of unique values from the gender column

In [11]:
df1['Gender'].nunique()

2

#### 9. Display count of unique values in gender column

In [12]:
df1['Gender'].value_counts()

Female    4
Male      3
Name: Gender, dtype: int64

#### 10. Find Total number of students having marks between 90 to 100 (inclusive) using between method

In [13]:
# greater than 90
df1[df1['Marks'] >= 90]

      name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
4   Parshv     90    Male
6  Archana     99  Female

In [14]:
# between 90 and 100
df1[(df1['Marks'] >= 90) & (df1["Marks"] <= 100)]

      name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
4   Parshv     90    Male
6  Archana     99  Female

In [15]:
#Total number of student
len(df1[(df1["Marks"] >= 90) & (df1["Marks"] <= 100)])

4

In [16]:
# Using between method
sum(df1['Marks'].between(90,100))

4

#### 11. Find Average Marks

In [17]:
df1["Marks"].mean()

92.14285714285714

#### 12. Apply Method

In [18]:
def marks(x):
    return x/2

In [19]:
df1["Half_Marks"] = df1['Marks'].apply(marks)
df1

      name  Marks  Gender  Half_Marks
0  Priyang     98    Male        49.0
1  Aadhaya     89  Female        44.5
2   Krisha     99  Female        49.5
3   Vedant     87    Male        43.5
4   Parshv     90    Male        45.0
5   Mittal     83  Female        41.5
6  Archana     99  Female        49.5

In [20]:
# with lambda function
df1['Marks'].apply(lambda x:x/2)

0    49.0
1    44.5
2    49.5
3    43.5
4    45.0
5    41.5
6    49.5
Name: Marks, dtype: float64

In [21]:
# len, string
df1['name'].apply(len)

0    7
1    7
2    6
3    6
4    6
5    6
6    7
Name: name, dtype: int64

#### 13. Map  function

In [22]:
df1

      name  Marks  Gender  Half_Marks
0  Priyang     98    Male        49.0
1  Aadhaya     89  Female        44.5
2   Krisha     99  Female        49.5
3   Vedant     87    Male        43.5
4   Parshv     90    Male        45.0
5   Mittal     83  Female        41.5
6  Archana     99  Female        49.5

In [23]:
df1['Male_Female'] = df1['Gender'].map({'Male' : 1 , 'Female' : 0})
df1

      name  Marks  Gender  Half_Marks  Male_Female
0  Priyang     98    Male        49.0            1
1  Aadhaya     89  Female        44.5            0
2   Krisha     99  Female        49.5            0
3   Vedant     87    Male        43.5            1
4   Parshv     90    Male        45.0            1
5   Mittal     83  Female        41.5            0
6  Archana     99  Female        49.5            0

#### 14. Drop the column(s)

In [24]:
df1.drop('Male_Female', axis = 1) #axis = 1 delete column

      name  Marks  Gender  Half_Marks
0  Priyang     98    Male        49.0
1  Aadhaya     89  Female        44.5
2   Krisha     99  Female        49.5
3   Vedant     87    Male        43.5
4   Parshv     90    Male        45.0
5   Mittal     83  Female        41.5
6  Archana     99  Female        49.5

In [25]:
df1.drop(['Male_Female' , 'Half_Marks'] , axis = 1 )

      name  Marks  Gender
0  Priyang     98    Male
1  Aadhaya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [26]:
# inplace true to change original dataframe
df1.drop(['Male_Female' , 'Half_Marks'] , inplace = True,  axis = 1 )
df1

      name  Marks  Gender
0  Priyang     98    Male
1  Aadhaya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

#### 15. Print Name of the columns

In [27]:
df1.columns

Index(['name', 'Marks', 'Gender'], dtype='object')

In [28]:
df1.index

RangeIndex(start=0, stop=7, step=1)

#### 16. Sort th Dataframe as per the Marks Column

In [29]:
df1

      name  Marks  Gender
0  Priyang     98    Male
1  Aadhaya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [30]:
# for sorting we use
df1.sort_values(by = "Marks", ascending=False) #ascending  = False to sort reverse

      name  Marks  Gender
2   Krisha     99  Female
6  Archana     99  Female
0  Priyang     98    Male
4   Parshv     90    Male
1  Aadhaya     89  Female
3   Vedant     87    Male
5   Mittal     83  Female

In [31]:
df1.sort_values(by = ["Marks" , "Gender"], ascending=False)

      name  Marks  Gender
2   Krisha     99  Female
6  Archana     99  Female
0  Priyang     98    Male
4   Parshv     90    Male
1  Aadhaya     89  Female
3   Vedant     87    Male
5   Mittal     83  Female

#### 17. Display Name & Marks of the Female Students

In [32]:
df1[df1['Gender'] == 'Female'][['name','Marks']]

      name  Marks
1  Aadhaya     89
2   Krisha     99
5   Mittal     83
6  Archana     99

In [33]:
#Other way
df1[df1['Gender'].isin(['Female'])][['name','Marks']]

      name  Marks
1  Aadhaya     89
2   Krisha     99
5   Mittal     83
6  Archana     99